{"data":{"site":{"siteMetadata":{"author":{"name":"kim beom gyu","contacts":{"twitter":"#"}},"disqusShortname":"kimbeomgyu","subtitle":"반갑습니다. 개발자 김범규 블로그입니다.","title":"Blog by kimbeomgyu","url":"https://kimbeomgyu.github.io"}},"markdownRemark":{"id":"a40195fc-1ff6-5f76-869a-b28405b70ab6","html":"<p>저는 과거에 신입 UI 디자이너였습니다. 그 때에 처음 입사했던 회사에서 개발자들이 있었는데 개발자들과 소통하면서 디자인을 하던 저와는 전혀 다른 그들의 일에 관심을 갖게되었습니다. 방법을 찾다가 처음에는 흔히 알려진 국비지원을 고민 하던중 지인에게 코드스테이츠라는 곳에서 ‘2017 J2S Conference’ 가 있는데 들어보라는 권유를 받았고, 현직 개발자, 코드스테이츠에서 수료를 끝낸 개발자, 코드스테이츠 관계자들의 강연을 듣고 코드스테이츠에서 배움으로써 개발자가 되어야겠다는 결심을 하였습니다.</p>\n<p>결코 쉬운 결심이 아니였지만 정말 고민을 많이 하였는데 다른 이유도 아닌 돈때문이였습니다. 부모님의 지원을 받을 수 없는 입장이기때문에 국비지원을 하려고 했던 이유도 마찬가지였었는데, 현실적으로 생각했을때 Immersive Course까지 하려면 몇백만원이라는 돈이드는데 적은 돈도 아니거니와 배우면서 일을 할 수 없기때문에 생활비까지 걱정해야했습니다.</p>\n<p>1년이라는 기간을 정했고, 1년동안 서비스업종에서 일을하면서 배우고 생활할 수 있는 돈을 모으기로 정해서, 1년이 지난 이후에 지금 이곳 코드스테이츠에서 배웠습니다. 물론 권유한 사람이 있었고, 말린 사람들도 있었습니다. 뭐하러 그렇게까지 배워야하냐고 말했던 사람도 있었습니다. 그럼에도 코드스테이츠를 선택한 이유는 원래 자기돈으로 공부하는게 아까운법이라고… 내가 끝까지 공부할 수 있는 동기가 필요했습니다. 그리고 단순한 강의가 아닌 현직개발자가 가르치며 비전공자인 제가 실무에 투입될 수 있는 커리큘럼이라고 생각했기 때문입니다!</p>\n<p>그렇게 시작한 코드스테이츠는 정말 너무나도 힘들었습니다. 처음 pre corse에서 8주간 JavaScript 를 다루고, 공부하며, 프로그래밍이라는 것에 대해서 배웠습니다. 조건문, 반복문, 함수, 객체 등등 전혀 새로운 세계였습니다.\nHTML,CSS들도 배웠습니다. 처음에는 너무나도 어려웠지만, 계속해서 배우고, 익숙해지니 이해가 되기 시작했습니다.\n그리고 이렇게 8주간의 교육이 지나고 IAT(Immersive Course Admission Test)라는 시험을 통해서 당당히 통과하고, Immersive Course를 듣게 되었습니다. 이 시험은 Pre Course 기간동안 배운 내용을 잘 이해했는지 검증하고, Interview를 통해서 문제를 어떻게 해결해 나가는지를 확인합니다.</p>\n<p>그 이후에 13주의 시간동안 오로지 코딩에만 집중적으로 몰두해서 문제를 해결합니다. 아침 일찍부터 오후 늦게까지. 부족하다 생각되면 밤 늦게 까지 문제를 해결하고, 공부를 하게 되었습니다. 지금 생각해보면 집중을 너무 했었는지 시간이 너무나도 빨리 지나가서 아쉬운 생각이 많이 들었습니다. 13주라는 시간에서 약 5주를 2 ~ 4일 단위에 Sprint를 진행하였습니다. 초반의 Sprint는 JavaScript 에 대해 깊이 있게 이해하기 위한 과제들이 주를 이루었고, 후반의 Sprint는 실제 업무 환경에서 해결해야하는 과제들과 유사하게 설계되어 있었습니다. 후반부로 갈수록 점점 더 수준이 높은 기술들을 학습할 수 있는 도전적인 과제가 주어졌습니다.</p>\n<p>Immersive Course에서 Code States가 가장 중요시하는 것은 어려운 과제에 집요하게 도전하는 태도, 그리고 스스로 문제를 해결하는 능력이였습니다. Sprint가 진행되는 동안 이러한 태도와 능력을 기를 수 있었고, 현재는 ‘나’라는 사람이 온전히 스스로의 능력을 키우기 위해 노력하고 있습니다. 5주라는 시간동안 정신없이 배워나가는데 솔직히 고통스러웠습니다. 너무나도 많은 정보를 머릿속에 눌러담는 느낌이였습니다. 하지만 6주차때에 solo week를 통해서 나름대로 배운것을 정리하고, 온전히 나의 것으로 다듬을 수 있었습니다. 그 이후에는 수강생들끼리 기획하고, 구성하고, 팀으로써 2주간 진행하는 하나의 프로젝트를 제작하게 되었습니다.</p>\n<p>프로젝트는 다음이야기에서…</p>","fields":{"slug":"/posts/4/","tagSlugs":["/tag/code-states/","/tag/immersive/"]},"frontmatter":{"date":"2019-03-26T20:07","description":"코드스테이츠 수료 후기 (1)","tags":["CodeStates","Immersive"],"title":"CodeStates Immersive 후기 (1)"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/posts/4/"}}